УТ_для_edt/src/Catalogs/смартОтчетПоГарантииМимаки/смартОтчетПоГарантииМимаки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартОтчетПоГарантииМимаки</name>
  <comment>//++ #1287 смарт: Фролов 13.03.2023 //Работа с гарантийными и коммерческими запасными частями</comment>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроблемы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПоломки</name>
    <type>
      <types>EnumRef.смартПричиныПоломки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметПоломки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеУстраненияПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоОборудования</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФотоШильдаОборудования</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ParametersДоИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>LogДоИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>LogПослеИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ParametersПослеИнсталяции</name>
    <type>
      <types>CatalogRef.смартЗаявкаНаГарантийныйРемонтПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Чернила</name>
    <attributes>
      <name>Чернила</name>
      <type>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>35</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартОтчетПоГарантииМимаки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартЗаявкаНаГарантийныйРемонт") Тогда
		// Заполнение шапки
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Если НЕ СтрДлина(ДанныеЗаполнения.Номер)<10 Тогда
			Код=ДанныеЗаполнения.Номер;
			Наименование="Отчет по гарантии Мимаки (смарт) №"+ДанныеЗаполнения.Номер+" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		Иначе
			Наименование="Отчет по гарантии Мимаки (смарт)";
		КонецЕсли;
		Серия=ДанныеЗаполнения.Серия;	
		Оборудование=ДанныеЗаполнения.Оборудование;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если СтрДлина(Код)<10 Тогда
		ЭтотОбъект.УстановитьНовыйКод("PRE-");
		Наименование="Отчет по гарантии Мимаки (смарт) №"+Код+" от "+Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	КонецЕсли;	
КонецПроцедуры
